backend/app/controllers/api/v1/players_controller.rb

INSERT INTO "players" ("name", "wins", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Tester1"], ["wins", 1], ["created_at", "2020-07-16 01:26:29.680613"], ["updated_at", "2020-07-16 01:26:29.680613"]]
---
  def create
    @player = Player.new(player_params)


    if @player.save

UPDATE "players" SET "wins" = ?, "updated_at" = ? WHERE "players"."id" = ?  [["wins", 2], ["updated_at", "2020-07-16 01:27:18.556593"], ["id", 6]]
---
  def update
      if @player.update(player_params)

SELECT  "players".* FROM "players" WHERE "players"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
  def set_player
    @player = Player.find(params[:id])